{
  "site": {
    "title": "Island Culture",
    "description": "A diverse marketplace for Hong Kong local products, sharing Hong Kong culture and creativity"
  },
  "home": {
    "categories": {
      "title": "Main Categories",
      "hkculture": "Hong Kong Culture",
      "hkcultureDesc": "Explore the unique charm and creativity of Hong Kong culture",
      "culture": "Cultural & Travel",
      "cultureDesc": "Discover Hong Kong cultural creativity and travel products",
      "newyear": "Lunar New Year",
      "newyearDesc": "New Year special gifts and decorations"
    },
    "explore": "Explore Products"
  },
  "nav": {
    "home": "Home",
    "hkculture": "HK Culture",
    "culture": "Cultural & Travel",
    "hkfestival": "Festivals",
    "about": "About Us",
    "festival": {
      "christmas": "Christmas",
      "halloween": "Halloween",
      "newyear": "Lunar New Year"
    }
  },
  "footer": {
    "quickLinks": "Quick Links",
    "festivalSpecial": "Festival Specials",
    "contactUs": "Contact Us",
    "address": "FP-20 & 24, Pottinger Street, Central, Hong Kong",
    "phone": "(852) 2580 8002",
    "email": "info@island-cult.com",
    "scanQR": "Scan QR code to contact us:",
    "whatsapp": "WhatsApp",
    "wechat": "WeChat",
    "copyright": "© 2025 Island Cultral Co. Ltd. All rights reserved."
  },
  "language": {
    "zh-TW": "繁體中文",
    "zh-CN": "简体中文",
    "en": "English"
  },

  "christmas": {
    "subtitle": "Hong Kong-style Christmas gifts and decorations",
    "header": "Hong Kong Christmas",
    "description": "In Hong Kong, Christmas is a festival full of Eastern and Western cultural fusion. We offer unique Hong Kong-style Christmas products to make your holiday celebration more local.",
    "featureTitle": "Christmas Limited Collection",
    "featureAlt": "Hong Kong Christmas",
    "featureDesc1": "Our Christmas limited collection combines Western Christmas elements with Hong Kong local culture, creating a unique holiday experience. From decorations to gifts, each item is full of creativity and thoughtfulness.",
    "featureDesc2": "Whether you're giving them to friends and family or decorating your home, these products will make your Christmas more special.",
    "availability": "Christmas products will be available from October each year. Stay tuned!"
  },
  "culture": {
    "subtitle": "Hong Kong's unique cultural and travel souvenirs",
    "header": "Explore Hong Kong's Cultural Creativity",
    "description": "We select local cultural creative products from Hong Kong to showcase the talents and creativity of local designers and artists.",
    "featureTitle": "Hong Kong Features",
    "featureAlt": "Hong Kong Features",
    "featureDesc1": "From traditional to modern, we collect a variety of products reflecting Hong Kong's unique culture and history. Each piece represents an aspect of Hong Kong and tells a story of this city.",
    "featureDesc2": "These products are not just souvenirs, but carriers of Hong Kong culture. What you take home is not just an item, but also the spirit and emotion of Hong Kong.",
    "comingSoonTitle": "Coming Soon",
    "comingSoonDesc": "We are working with more local designers and will bring more exciting cultural creative products. Stay tuned!"
  },
  "halloween": {
    "subtitle": "Halloween items combining Hong Kong local culture",
    "header": "Hong Kong Style Halloween",
    "description": "Halloween is becoming increasingly popular in Hong Kong. We blend local Hong Kong elements with Halloween themes to create a unique festival experience.",
    "featuredTitle": "Halloween Featured",
    "category1": "Decorations",
    "category1Desc": "Unique decorations combining traditional Chinese elements with Halloween atmosphere.",
    "category2": "Costumes & Props",
    "category2Desc": "Creative Halloween costumes and props, blending Eastern and Western elements.",
    "category3": "Special Edition Toys",
    "category3Desc": "Halloween limited-edition toys with unique designs blending Chinese and Western cultures.",
    "availability": "Halloween products will be available from September each year. Stay tuned!"
  },
  "newyear": {
    "title": "Lunar New Year",
    "subtitle": "Special products to celebrate Lunar New Year",
    "header": "Welcome the Lunar New Year",
    "description": "Lunar New Year is the most important traditional festival for Chinese people. We provide a variety of beautiful New Year decorations and gifts to help you create a festive atmosphere.",
    "category1": "New Year Decorations",
    "category1Desc": "Spring couplets, lanterns, window paper-cuts and other traditional New Year decorations to fill your home with festive atmosphere.",
    "category2": "New Year Gift Boxes",
    "category2Desc": "Beautifully packaged gift boxes containing various traditional candies, cookies, and tea, ideal for visiting friends and family.",
    "category3": "Limited Edition Toys",
    "category3Desc": "Limited edition toys and collectibles themed around the zodiac animal of the year, making them precious souvenirs.",
    "availability": "Lunar New Year products will be available two months before the festival. Stay tuned!"
  },
  "hkculture": {
    "title": "Hong Kong Culture",
    "subtitle": "Explore the unique charm of Hong Kong culture",
    "header": "Hong Kong Cultural Heritage",
    "description": "Hong Kong is a unique place where Eastern and Western cultures blend, with a rich and diverse cultural heritage and modern creativity. From traditional festivals to contemporary art, from street food to fine dining, Hong Kong's cultural foundation is deep and diverse.",
    "featuredTitle": "Cultural Highlights",
    "ipDevelopment": "IP Development",
    "ipDesc": "We are committed to developing and promoting Hong Kong's local cultural IP, bringing Hong Kong's unique charm to the world through innovative design and products. We collaborate with local artists to transform elements of Hong Kong's street culture, architectural features, and culinary traditions into unique designs and products.",
    "travelCulture": "Travel Culture",
    "travelDesc": "Experience Hong Kong's unique travel culture, from bustling urban landscapes to serene country parks, from traditional temples to modern architecture. Hong Kong offers a rich variety of travel resources. We provide unique Hong Kong travel experiences and souvenirs for you to take away special memories of Hong Kong.",
    "category1": "Cultural Workshops",
    "category1Desc": "Participate in our cultural workshops to make traditional Hong Kong crafts by hand and experience Hong Kong's cultural heritage.",
    "category2": "Hong Kong Stories",
    "category2Desc": "Learn about Hong Kong's historical changes and cultural stories through multimedia exhibitions and interactive experiences.",
    "category3": "Creative Products",
    "category3Desc": "Creative products incorporating Hong Kong elements, carefully crafted by local designers, showcase Hong Kong's creative power.",
    "learnMore": "Learn More"
  },
  "hkfestival": {
    "title": "Hong Kong Festivals",
    "subtitle": "Explore the unique festival celebrations in Hong Kong",
    "header": "Traditional & Modern Festivals",
    "description": "Hong Kong celebrates a unique blend of Eastern and Western festivals throughout the year. From traditional Chinese festivals like Lunar New Year and Mid-Autumn Festival to Western celebrations like Christmas and Halloween, each is given a distinctive Hong Kong twist.",
    "featuredTitle": "Festival Highlights",
    "category1": "Traditional Chinese Festivals",
    "category1Desc": "Experience traditional Chinese festivals like Lunar New Year, Mid-Autumn Festival, and Dragon Boat Festival with unique Hong Kong characteristics and customs.",
    "category2": "Western Festivals with Hong Kong Flair",
    "category2Desc": "Discover how Western celebrations like Christmas and Halloween are transformed with local Hong Kong elements, creating a unique cultural fusion.",
    "category3": "Local Hong Kong Celebrations",
    "category3Desc": "Learn about festivals and celebrations unique to Hong Kong, reflecting the city's rich history and cultural identity.",
    "exploreMore": "Explore Our Festival Collections"
  }
}
