{
  "site": {
    "title": "Island Culture",
    "description": "A diverse marketplace for Hong Kong local products, sharing Hong Kong culture and creativity"
  },
  "home": {
    "categories": {
      "title": "Main Categories",
      "hkculture": "Hong Kong Culture",
      "hkcultureDesc": "Explore the unique charm and creativity of Hong Kong culture",
      "festival": "Festivals",
      "festivalDesc": "Discover our special seasonal collections and festive products",
      "ipPartnerships": "IP Partnerships",
      "ipPartnershipsDesc": "Connect your brand with Hong Kong's vibrant market"
    },
    "explore": "Explore Products"
  },
  "nav": {
    "home": "Home",
    "hkculture": "HK Culture",
    "hkfestival": "Festivals",
    "about": "About Us",
    "ipPartnerships": "IP Partnerships",
    "festival": {
      "christmas": "Christmas",
      "halloween": "Halloween",
      "newyear": "Lunar New Year"
    }
  },
  "footer": {
    "quickLinks": "Quick Links",
    "festivalSpecial": "Festival Specials",
    "contactUs": "Contact Us",
    "address": "FP-20 & 24, Pottinger Street, Central, Hong Kong",
    "phone": "(852) 2580 8002",
    "email": "info@island-cult.com",
    "scanQR": "Scan QR code to contact us:",
    "whatsapp": "WhatsApp",
    "wechat": "WeChat",
    "copyright": "© 2025 Island Cultral Co. Ltd. All rights reserved."
  },
  "language": {
    "zh-TW": "繁體中文",
    "zh-CN": "简体中文",
    "en": "English"
  },

  "christmas": {
    "subtitle": "Hong Kong-style Christmas gifts and decorations",
    "header": "Hong Kong Christmas",
    "description": "In Hong Kong, Christmas is a festival full of Eastern and Western cultural fusion. We offer unique Hong Kong-style Christmas products to make your holiday celebration more local.",
    "featureTitle": "Christmas Limited Collection",
    "featureAlt": "Hong Kong Christmas",
    "featureDesc1": "Our Christmas limited collection combines Western Christmas elements with Hong Kong local culture, creating a unique holiday experience. From decorations to gifts, each item is full of creativity and thoughtfulness.",
    "featureDesc2": "Whether you're giving them to friends and family or decorating your home, these products will make your Christmas more special.",
    "availability": "Christmas products will be available from October each year. Stay tuned!"
  },

  "halloween": {
    "subtitle": "Halloween items combining Hong Kong local culture",
    "header": "Hong Kong Style Halloween",
    "description": "Halloween is becoming increasingly popular in Hong Kong. We blend local Hong Kong elements with Halloween themes to create a unique festival experience.",
    "featuredTitle": "Halloween Featured",
    "category1": "Decorations",
    "category1Desc": "Unique decorations combining traditional Chinese elements with Halloween atmosphere.",
    "category2": "Costumes & Props",
    "category2Desc": "Creative Halloween costumes and props, blending Eastern and Western elements.",
    "category3": "Special Edition Toys",
    "category3Desc": "Halloween limited-edition toys with unique designs blending Chinese and Western cultures.",
    "availability": "Halloween products will be available from September each year. Stay tuned!"
  },
  "newyear": {
    "title": "Lunar New Year",
    "subtitle": "Special products to celebrate Lunar New Year",
    "header": "Welcome the Lunar New Year",
    "description": "Lunar New Year is the most important traditional festival for Chinese people. We provide a variety of beautiful New Year decorations and gifts to help you create a festive atmosphere.",
    "category1": "New Year Decorations",
    "category1Desc": "Spring couplets, lanterns, window paper-cuts and other traditional New Year decorations to fill your home with festive atmosphere.",
    "category2": "New Year Gift Boxes",
    "category2Desc": "Beautifully packaged gift boxes containing various traditional candies, cookies, and tea, ideal for visiting friends and family.",
    "category3": "Limited Edition Toys",
    "category3Desc": "Limited edition toys and collectibles themed around the zodiac animal of the year, making them precious souvenirs.",
    "availability": "Lunar New Year products will be available two months before the festival. Stay tuned!"
  },
  "hkculture": {
    "title": "Hong Kong Culture",
    "subtitle": "Explore the unique charm of Hong Kong culture",
    "header": "Hong Kong Cultural Heritage",
    "description": "Hong Kong is a unique place where Eastern and Western cultures blend, with a rich and diverse cultural heritage and modern creativity. From traditional festivals to contemporary art, from street food to fine dining, Hong Kong's cultural foundation is deep and diverse.",
    "featuredTitle": "Cultural Highlights",
    "ipDevelopment": "IP Development",
    "ipDesc": "We are committed to developing and promoting Hong Kong's local cultural IP, bringing Hong Kong's unique charm to the world through innovative design and products. We collaborate with local artists to transform elements of Hong Kong's street culture, architectural features, and culinary traditions into unique designs and products.",
    "travelCulture": "Travel Culture",
    "travelDesc": "Experience Hong Kong's unique travel culture, from bustling urban landscapes to serene country parks, from traditional temples to modern architecture. Hong Kong offers a rich variety of travel resources. We provide unique Hong Kong travel experiences and souvenirs for you to take away special memories of Hong Kong.",
    "category1": "Cultural Workshops",
    "category1Desc": "Participate in our cultural workshops to make traditional Hong Kong crafts by hand and experience Hong Kong's cultural heritage.",
    "category2": "Hong Kong Stories",
    "category2Desc": "Learn about Hong Kong's historical changes and cultural stories through multimedia exhibitions and interactive experiences.",
    "category3": "Creative Products",
    "category3Desc": "Creative products incorporating Hong Kong elements, carefully crafted by local designers, showcase Hong Kong's creative power.",
    "learnMore": "Learn More"
  },
  "hkfestival": {
    "title": "Hong Kong Festivals",
    "subtitle": "Explore the unique festival celebrations in Hong Kong",
    "header": "Traditional & Modern Festivals",
    "description": "Hong Kong celebrates a unique blend of Eastern and Western festivals throughout the year. From traditional Chinese festivals like Lunar New Year and Mid-Autumn Festival to Western celebrations like Christmas and Halloween, each is given a distinctive Hong Kong twist.",
    "featuredTitle": "Festival Highlights",
    "category1": "Traditional Chinese Festivals",
    "category1Desc": "Experience traditional Chinese festivals like Lunar New Year, Mid-Autumn Festival, and Dragon Boat Festival with unique Hong Kong characteristics and customs.",
    "category2": "Western Festivals with Hong Kong Flair",
    "category2Desc": "Discover how Western celebrations like Christmas and Halloween are transformed with local Hong Kong elements, creating a unique cultural fusion.",
    "category3": "Local Hong Kong Celebrations",
    "category3Desc": "Learn about festivals and celebrations unique to Hong Kong, reflecting the city's rich history and cultural identity.",
    "exploreMore": "Explore Our Festival Collections"
  },
  "about": {
    "subtitle": "The Story of Hong Kong Cultural Marketplace",
    "mission": "Our Mission",
    "missionText": "Hong Kong Cultural Marketplace is dedicated to promoting local Hong Kong culture and creativity, supporting local designers and artists. We aim to provide a platform for more people to discover and appreciate Hong Kong's unique cultural products.",
    "story": "Our Story",
    "storyText1": "Hong Kong Cultural Marketplace was founded in 2023 by a group of young people passionate about Hong Kong culture. We noticed that although Hong Kong has a rich cultural heritage and creative industries, there was a lack of a dedicated platform to showcase and sell these products.",
    "storyText2": "Therefore, we decided to create this marketplace, bringing together various unique cultural products from Hong Kong, from traditional crafts to modern designs, from local toys to festive decorations, providing consumers with a rich variety of choices.",
    "values": "Our Values",
    "value1": "Local Support",
    "value1Text": "We prioritize working with local designers, artists, and manufacturers to support Hong Kong's creative industries.",
    "value2": "Cultural Heritage",
    "value2Text": "We are committed to preserving and promoting Hong Kong's cultural heritage, incorporating traditional elements into modern designs.",
    "value3": "Innovative Design",
    "value3Text": "We encourage innovative and unique designs, showcasing the vitality and diversity of Hong Kong's creative industries.",
    "value4": "Quality Assurance",
    "value4Text": "We strictly control the quality of each product to ensure customers have the best shopping experience.",
    "contact": "Contact Us",
    "address": "FP-20 & 24, Pottinger Street, Central, Hong Kong",
    "phone": "(852) 2580 8002",
    "email": "info@island-cult.com",
    "scanQR": "Scan QR code to contact us:",
    "whatsapp": "WhatsApp",
    "wechat": "WeChat"
  },
  "ipPartnerships": {
    "title": "IP Partnerships",
    "subtitle": "Connecting Chinese & Global IPs with Hong Kong's Market",
    "header": "IP Collaboration Opportunities",
    "description": "Hong Kong serves as a unique gateway connecting mainland China and international IP holders to global markets. We offer strategic partnerships to bring iconic characters, brands, and creative properties to life through high-quality souvenirs and collectibles.",
    "partnerWithUs": "Partner With Us",
    "sections": {
      "mainlandIPs": {
        "title": "Mainland China IPs",
        "description": "We collaborate with popular mainland China IPs to bring their beloved characters and stories to international audiences through premium merchandise and souvenirs.",
        "benefits": [
          "Access to Hong Kong's international market with billions of tourists annually",
          "High-quality manufacturing and authenticity guarantees",
          "Marketing support across multiple channels",
          "Regulatory compliance and IP protection"
        ]
      },
      "overseasIPs": {
        "title": "International IPs",
        "description": "We help international brands and IP owners enter the vast Chinese market through our established distribution networks and cultural expertise.",
        "benefits": [
          "Strategic entry into mainland China's massive consumer market",
          "Cultural adaptation and localization expertise",
          "Established distribution and retail networks",
          "Comprehensive IP protection in Asian markets"
        ]
      },
      "collaboration": {
        "title": "Collaboration Models",
        "options": [
          {
            "title": "Licensing Partnerships",
            "description": "License your IP for high-quality merchandise and souvenirs with guaranteed quality control and brand consistency."
          },
          {
            "title": "Co-branded Products",
            "description": "Create unique co-branded products that merge your IP with Hong Kong cultural elements for unique market positioning."
          },
          {
            "title": "Exclusive Collections",
            "description": "Develop exclusive, limited-edition collections for special events or seasonal promotions."
          },
          {
            "title": "Pop-up Experiences",
            "description": "Create immersive retail experiences and pop-up stores featuring your IP in prime Hong Kong locations."
          }
        ]
      }
    },
    "successStories": "Success Stories",
    "contactUs": "Interested in partnership opportunities? Contact our IP collaboration team to discuss how we can work together.",
    "contactButton": "Contact IP Team"
  }
}
